ZeroZap/xhsc/HC32L021/mcu/EWARM/HC32L021.svd
                <register>
                    <name>PERI_CLKEN1</name>
                    <description>desc PERI_CLKEN1</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CTIM0_EN</name>
                            <description>desc CTIM0_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTIM1_EN</name>
                            <description>desc CTIM1_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTRIM_EN</name>
                            <description>desc CTRIM_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERI_RESET0</name>
                    <description>desc PERI_RESET0</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x5017084C</resetValue>
                    <resetMask>0x5017084A</resetMask>
                    <fields>
                        <field>
                            <name>LPUART0_RST</name>
                            <description>desc LPUART0_RST</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPUART1_RST</name>
                            <description>desc LPUART1_RST</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI_RST</name>
                            <description>desc SPI_RST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ATIM3_RST</name>
                            <description>desc ATIM3_RST</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC_RST</name>
                            <description>desc ADC_RST</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC_RST</name>
                            <description>desc VC_RST</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNG_RST</name>
                            <description>desc TRNG_RST</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_RST</name>
                            <description>desc RTC_RST</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_RST</name>
                            <description>desc GPIO_RST</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI2C_RST</name>
                            <description>desc HSI2C_RST</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERI_RESET1</name>
                    <description>desc PERI_RESET1</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CTIM0_RST</name>
                            <description>desc CTIM0_RST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTIM1_RST</name>
                            <description>desc CTIM1_RST</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTRIM_RST</name>
                            <description>desc CTRIM_RST</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEBUG_ACTIVE</name>
                    <description>desc DEBUG_ACTIVE</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30B00</resetMask>
                    <fields>
                        <field>
                            <name>IWDT_DEBUG</name>
                            <description>desc IWDT_DEBUG</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_DEBUG</name>
                            <description>desc RTC_DEBUG</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ATIM3_DEBUG</name>
                            <description>desc ATIM3_DEBUG</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTIM0_DEBUG</name>
                            <description>desc CTIM0_DEBUG</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTIM1_DEBUG</name>
                            <description>desc CTIM1_DEBUG</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
